tests/Workday/Request/example.req

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="urn:com.workday/bsvc" xmlns:ns2="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
	<SOAP-ENV:Body>
		<ns1:Get_Job_Postings_Request ns1:version="v31.0">
			<ns1:Request_Criteria>
				<ns1:Job_Requisition_Reference>
					<ns1:ID ns1:type="Job_Requisition_ID">84865WD</ns1:ID>
				</ns1:Job_Requisition_Reference>
				<ns1:Show_Only_Active_Job_Postings>true</ns1:Show_Only_Active_Job_Postings>
			</ns1:Request_Criteria>
			<ns1:Response_Filter>
				<ns1:Count>999</ns1:Count>
			</ns1:Response_Filter>
		</ns1:Get_Job_Postings_Request>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>